Repository: lyonel/lshw
Catalog: src/po/*.po
Languages: ka, tr

source: 32-bit processes
ka: 32-ბიტიანი პროცესები
tr: 32-bit işlemler

source: 64-bit processes
ka: 64-ბიტიანი პროცესები
tr: 64-bit işlemler

source: CPU virtualization (Vanderpool)
ka: CPU ვირტუალიზაცია (Vanderpool)
tr: CPU sanallaştırma (Vanderpool)

source: Logical CPU
ka: ლოგიკური CPU
tr: Mantıksal CPU

source: L1 cache
ka: L1 კეში
tr: L1 önbelleği

source: L2 cache
ka: L2 კეში
tr: L2 önbelleği

source: Other Battery
ka: სხვა ელემენტი

source: Unknown Battery
ka: უცნობი ელემენტი

source: Lead Acid Battery
ka: ტყვია-მჟავის ელემენტი

source: Nickel Cadmium Battery
ka: ნიკელ-კადმიუმის ელემენტი

source: Nickel Metal Hydride Battery
ka: ნიკელი-ლითონის-ჰიდრიდის ელემენტი

source: Lithium Ion Battery
ka: ლითიუმ-იონის ელემენტი

source: Zinc Air Battery
ka: თუთია-ჰაერის ელემენტი

source: Lithium Polymer Battery
ka: ლითიუმ-პოლიმერის ელემენტი

source: Battery
ka: კვების ელემენტი

source: Server Blade
ka: ბლეიდ-სერვერი
tr: Sunucu Blade

source: Connectivity Switch
ka: დაკავშირების კომუტატორი

source: System Management Module
ka: სისტემის მართვის მოდული
tr: Sistem Yönetim Modülü

source: Processor Module
ka: პროცესორის მოდული
tr: İşlemci Modülü

source: I/O Module
ka: I/O მოდული
tr: G/Ç Modülü

source: Memory Module
ka: მეხსიერების მოდული
tr: Hafıza modülü

source: Daughter Board
ka: დამხმარე დაფა
tr: Ara Kart

source: Motherboard
ka: მთავარი დაფა
tr: Anakart

source: Processor/Memory Module
ka: პროცესორის/მეხსიერების მოდული
tr: İşlemci/Bellek Modülü

source: Processor/IO Module
ka: პროცესორის/IO მოდული
tr: İşlemci/IO Modülü

source: Interconnect Board
ka: მაკავშირებელი დაფა
tr: Ara Bağlantı Kartı

source: ISA bus
ka: ISA მატარებელი
tr: ISA veri yolu

source: MCA bus
ka: MCA მატარებელი
tr: MCA veri yolu

source: EISA bus
ka: EISA მატარებელი
tr: EISA veri yolu

source: PCI bus
ka: PCI მატარებელი
tr: PCI veri yolu

source: Advanced Power Management
ka: კვების დამატებითი მართვა
tr: Gelişmiş Güç Yönetimi

source: BIOS EEPROM can be upgraded
ka: BIOS EEPROM განახლებადია
tr: BIOS EEPROM yükseltilebilir

source: BIOS shadowing
ka: BIOS-ის დაჩრდილვა
tr: BIOS gölgeleme

source: VESA video extensions
ka: VESA ვიდეო გაფართოებები
tr: VESA video uzantıları

source: Booting from CD-ROM/DVD
ka: CD/DVD-ROM-დან ჩატვირთვა
tr: CD-ROM/DVD'den önyükleme

source: Selectable boot path
ka: არჩევადი ჩატვირთვის ბილიკი
tr: Seçilebilir önyükleme yolu

source: BIOS ROM is socketed
ka: BIOS ROM სოკეტში ზის
tr: BIOS ROM soketli

source: Booting from PCMCIA
ka: მიმდინარეობს PCMCIA-დან ჩატვირთვა
tr: PCMCIA'dan önyükleme

source: Enhanced Disk Drive extensions
ka: გაუმჯობესებული დისკის ამძრავის გაფართოებები
tr: Gelişmiş Disk Sürücüsü uzantıları

source: NEC 9800 floppy
ka: დისკეტა NEC 9800
tr: NEC 9800 disket

source: Toshiba floppy
ka: Toshiba-ის დისკეტა
tr: Toshiba disketi

source: 5.25" 360KB floppy
ka: 5.25" 360KB დისკეტა
tr: 5.25" 360KB disket

source: 5.25" 1.2MB floppy
ka: 5.25" 1.2MB დისკეტა
tr: 5.25" 1.2MB disket

source: 3.5" 720KB floppy
ka: 3.5" 720KB დისკეტა
tr: 3.5" 720KB disket

source: 3.5" 2.88MB floppy
ka: 3.5" 2.88MB დისკეტა
tr: 3.5" 2.88MB disket

source: Print Screen key
ka: ღილაკი Print Screen
tr: Ekranı Yazdır tuşu

source: i8042 keyboard controller
ka: კლავიატურის კონტროლერი i8042
tr: i8042 klavye denetleyicisi

source: INT14 serial line control
ka: INT14 სერიული ხაზის კონტროლი
tr: INT14 seri hat kontrolü

source: INT17 printer control
ka: INT17 პრინტერის კონტროლი
tr: INT17 yazıcı kontrolü

source: INT10 CGA/Mono video
ka: INT10 CGA/Mono ვიდეო

source: USB legacy emulation
ka: მოძველებული USB-ის ემულაცია
tr: USB eski öykünme

source: I2O booting
ka: I2O ჩატვირთვა
tr: I2O önyüklemesi

source: Booting from LS-120
ka: მიმდინარეობს ჩატვირთვა LS-120-დან
tr: LS-120'den önyükleme

source: Booting from ATAPI ZIP
ka: მიმდინარეობს ჩატვირთვა ATAPI ZIP-დან
tr: ATAPI ZIP'den önyükleme

source: Booting from IEEE1394 (Firewire)
ka: მიმდინარეობს ჩატვირთვა IEEE1394-დან (Firewire)
tr: IEEE1394'ten (Güvenlik duvarı) önyükleme

source: Smart battery
ka: ჭკვიანი ელემენტი
tr: Akıllı pil

source: BIOS boot specification
ka: BIOS-ის ჩატვირთვის სპეციფიკაცია
tr: BIOS önyükleme özelliği

source: Function-key initiated network service boot
ka: Function-ღილაკით ინიცირებული ქსელური სერვისის ჩატვირთვა
tr: İşlev tuşuyla başlatılan ağ hizmeti önyüklemesi

source: UEFI specification is supported
ka: UEFI სპეციფიკაცია მხარდაჭერილი არაა

source: This machine is a virtual machine
ka: ეს მანქანა ვირტუალური მანქანაა

source: Non-burst
ka: არა-იმპულსური
tr: Patlamayan

source: Burst
ka: იმპულსი
tr: Patlak

source: Pipeline burst
ka: ფაიფლაინის იმპულსი
tr: Boru hattı patlaması

source: Synchronous
ka: სინქრონული
tr: Senkron

source: Asynchronous
ka: ასინქრონული
tr: Asenkron

source: Internal
ka: შიდა
tr: Dahili

source: External
ka: გარე
tr: Harici

source: Write-through
ka: გამჭოლად-ჩაწერადი

source: Varies With Memory Address
ka: იცვლება მეხსიერების მისამართთან ერთად
tr: Bellek Adresine Göre Değişir

source: cache
ka: კეში
tr: önbellek

source: Instruction cache
ka: ინსტრუქციის კეში
tr: Talimat önbelleği

source: Data cache
ka: მონაცემების კეში
tr: Veri önbelleği

source: Unified cache
ka: გაერთიანებული კეში
tr: Birleşik önbellek

source: System board or motherboard
ka: სისტემის ან მთავარი დაფა
tr: Sistem kartı veya anakart

source: ISA add-on card
ka: ISA დამატებითი ბარათი
tr: ISA eklenti kartı

source: EISA add-on card
ka: EISA დამატებითი ბარათი
tr: EISA ek kartı

source: PCI add-on card
ka: PCI დამატებითი ბარათი
tr: PCI eklenti kartı

source: MCA add-on card
ka: MCA დამატებითი ბარათი
tr: MCA eklenti kartı

source: PCMCIA add-on card
ka: PCMCIA დამატებითი ბარათი
tr: PCMCIA eklenti kartı

source: Proprietary add-on card
ka: მესამე პირების შექმნილი დამატებითი ბარათი
tr: Özel ek kart

source: PC-98/C20 add-on card
ka: PC-98/C20 დამატებითი ბარათი
tr: PC-98/C20 eklenti kartı

source: PC-98/C24 add-on card
ka: PC-98/C24 დამატებითი ბარათი
tr: PC-98/C24 eklenti kartı

source: PC-98/E add-on card
ka: PC-98/E დამატებითი ბარათი
tr: PC-98/E eklenti kartı

source: PC-98/Local bus add-on card
ka: PC-98/ლოკალური მატარებლის დამატებითი ბარათი
tr: PC-98/Yerel veri yolu eklenti kartı

source: PC-98/Card slot add-on card
ka: PC-98/ბარათის სლოტის დამატებითი ბარათი
tr: PC-98/Kart yuvası eklenti kartı

source: Proprietary Card
ka: მესამე პირების შექმნილი ბარათი
tr: Özel Kart

source: Row of chips
ka: ჩიპების მწკრივი
tr: Cips satırı

source: Fast-paged
ka: სწრაფგვერდიანი
tr: Hızlı sayfalı

source: Static column
ka: სტატიკური სვეტი
tr: Statik sütun

source: Pseudo-static
ka: ფსევდოსტატიკური
tr: Sözde statik

source: Window DRAM
ka: ფანჯრული DRAM
tr: Pencere DRAM'i

source: Cache DRAM
ka: კეშის DRAM
tr: Önbellek DRAM'i

source: Non-volatile
ka: არააქროლადი
tr: Uçucu olmayan

source: Registered (Buffered)
ka: რეგისტრირებული (ბუფერით)

source: Unbuffered (Unregistered)
ka: ბუფერის გარეშე (დაურეგისტრირებელი)

source: Desktop Computer
ka: სამაგიდო კომპიუტერი
tr: Masaüstü Bilgisayar

source: Low Profile Desktop Computer
ka: დაბალი პროფილის სამაგიდო კომპიუტერი
tr: Düşük Profilli Masaüstü Bilgisayar

source: Pizza Box Computer
ka: პიცისყუთის ზომის კომპიუერი
tr: Pizza Kutusu Bilgisayarı

source: Mini Tower Computer
ka: კომპიუტერი პატარა ყუთით
tr: Mini Kule Bilgisayar

source: Tower Computer
ka: კომპიუტერის კორპუსი
tr: Kule Bilgisayar

source: Portable Computer
ka: გადატანადი კომპიუტერი
tr: Taşınabilir Bilgisayar

source: Laptop
ka: ლეპტოპი
tr: Dizüstü

source: Notebook
ka: ნოუთბუქი
tr: Diz üstü bilgisayar

source: Hand Held Computer
ka: ხელში დასაჭერი კომპიუტერი
tr: El Bilgisayarı

source: Docking Station
ka: სამაგრი დაფა
tr: Yerleştirme İstasyonu

source: All In One
ka: ყველა-ერთში
tr: Hepsi Bir Arada

source: Sub Notebook
ka: ქვე-ნოუთბუქი
tr: Diz üstü bilgisayar

source: Space-saving Computer
ka: პატარა ზომის კომპიუტერი
tr: Yerden Tasarruflu Bilgisayar

source: Lunch Box Computer
ka: სადილის ყუთის ზომის კომპიუტერი
tr: Yemek Kutusu Bilgisayarı

source: System
ka: სისტემა
tr: Sistem

source: Expansion Chassis
ka: გაფართოების კორპუსი
tr: Genişletme Kasası

source: Sub Chassis
ka: ქვე-კორპუსი
tr: Alt Kasa

source: Bus Expansion Chassis
ka: მატარებლის გაფართოების შასი
tr: Veri yolu Genişletme Kasası

source: Peripheral Chassis
ka: გარე კორპუსი
tr: Çevresel Kasa

source: RAID Chassis
ka: RAID შასი
tr: RAID Kasa

source: Rack Mount Chassis
ka: რეკში ჩასადგმელი შასი
tr: Raf Tipi Kasa

source: Sealed-case PC
ka: დალუქული PC
tr: Kapalı kasa PC

source: Multi-system
ka: მრავალსისტემიანი ყუთი
tr: Çoklu sistem

source: Compact PCI
ka: კომპაქტური PCI

source: Advanced TCA
ka: დამატებითი TCA

source: Blade
ka: ბლეიდი

source: Blade enclosure
ka: კალათი

source: Tablet
ka: ტაბლეტი

source: Convertible
ka: გარდაქმნადი

source: Detachable
ka: მოძრობადი

source: IoT Gateway
ka: IoT ნაგულისხმები რაუტერი

source: Embedded PC
ka: ჩაშენებული PC

source: Mini PC
ka: მინი PC

source: Stick PC
ka: კომპიუტერი ჩიპზე

source: [empty]
ka: [ცარიელი]
tr: [boş]

source: 64-bit capable
ka: შეუძლია 64-ბიტიანი გამოთვლა

source: Memory Controller
ka: მეხსიერების კონტროლერი
tr: Bellek Denetleyici

source: empty memory bank
ka: ცარიელი მეხსიერების სოკეტი
tr: boş hafıza yuvası

source: System Memory
ka: სისტემური მეხსიერება
tr: Sistem Belleği

source: Video Memory
ka: ვიდეო მეხსიერება
tr: Video Belleği

source: Flash Memory
ka: ფლეშ-მეხსიერება
tr: Flash Bellek

source: Cache Memory
ka: ქეშის მეხსიერება
tr: Ön Bellek

source: Generic Memory
ka: ზოგადი მეხსიერება
tr: Genel Bellek

source: Parity error correction
ka: პარიტეტის შეცდომის გასწორება

source: Single-bit error-correcting code (ECC)
ka: ერთბიტიანი შეცდომის-შესწორების კოდი (ECC)

source: Multi-bit error-correcting code (ECC)
ka: მრავალბიტიანი შეცდომის-შესწორების კოდი (ECC)

source: CRC error correction
ka: CRC შეცდომის გასწორება

source: make outbound connections
ka: გამავალი მიერთებების შექმნა
tr: giden bağlantılar yapmak

source: receive inbound connections
ka: შემომავალი მიერთებების მიღება
tr: gelen bağlantıları al

source: <!-- generated by lshw-
ka: <!-- გენერირებულია: lshw-
tr: <!-- lshw- tarafından oluşturuldu

source: <!-- WARNING: not running as root -->
ka: <!-- გაფრთხილება: არაა გაშვებული root მომხმარებლით -->
tr: <!-- UYARI: root olarak çalışmıyor -->

source: (none)
ka: (არაფერი)
tr: (yok)

source: memory
ka: მეხსიერება
tr: hafıza

source: (prefetchable)
ka: (წინასწარ-გამოთხოვნადი)
tr: (önceden alınabilir)

source: %lx(size=%ld)
ka: %lx(ზომა=%ld)
tr: %lx(boyut=%ld)

source: (unknown)
ka: (უცნობი)
tr: (bilinmiyor)

source: false
ka: მცდარი
tr: yanlış

source: true
ka: სიმართლე
tr: doğru

source: Linux LVM Physical Volume
ka: Linux LVM-ის ფიზიკური ტომი

source: System memory
ka: სისტემური მეხსიერება
tr: Sistem belleği

source: twisted pair
ka: დახვეული წყვილი
tr: bükülü çift

source: Media Independent Interface
ka: მედიაზე დამოუკიდებელი ინტერფეისი

source: optical fibre
ka: ოპტიკურბოჭკოვანი
tr: optik fiber

source: 10Mbit/s
ka: 10მბიტ/წმ

source: 10Mbit/s (full duplex)
ka: 10მბიტ/წმ (სრული დუპლექსი)
tr: 10Mbit/s (tam çift yönlü)

source: 100Mbit/s
ka: 100მბიტ/წმ

source: 100Mbit/s (full duplex)
ka: 100მბიტ/წმ (სრული დუპლექსი)
tr: 100Mbit/s (tam çift yönlü)

source: 1Gbit/s (full duplex)
ka: 1გბიტ/წმ (სრული დუპლექსი)
tr: 1Gbit/s (tam çift yönlü)

source: 2.5Gbit/s (full duplex)
ka: 2.5გბიტ/წმ (სრული დუპლექსი)

source: 5Gbit/s (full duplex)
ka: 5გბიტ/წმ (სრული დუპლექსი)

source: 10Gbit/s (full duplex)
ka: 10გბიტ/წმ (სრული დუპლექსი)

source: 25Gbit/s (full duplex)
ka: 25გბიტ/წმ (სრული დუპლექსი)

source: 40Gbit/s (full duplex)
ka: 40გბიტ/წმ (სრული დუპლექსი)

source: Auto-negotiation
ka: ავტომატური-მოლაპარაკება
tr: Otomatik anlaşma

source: Logical interface
ka: ლოგიკური ინტერფეისი
tr: Mantıksal arayüz

source: Physical interface
ka: ფიზიკური ინტერფეისი
tr: Fiziksel arayüz

source: Wireless interface
ka: უსადენო ინტერფეისი
tr: Kablosuz arayüz

source: DISABLED
ka: გამორთულია
tr: DEVRE DIŞI

source: description
ka: აღწერა
tr: açıklama

source: product
ka: პროდუქტი
tr: ürün

source: vendor
ka: მომწოდებელი
tr: satıcı

source: physical id
ka: ფიზიკური ID
tr: fiziksel kimlik

source: bus info
ka: მატარებელის ინფორმაცია
tr: veri yolu bilgileri

source: logical name
ka: ლოგიკური სახელი
tr: mantıksal ad

source: version
ka: ვერსია
tr: sürüm

source: date
ka: თარიღი

source: serial
ka: მიმდევრობითი
tr: seri

source: slot
ka: სლოტი
tr: yuva

source: size
ka: ზომა
tr: boyut

source: capacity
ka: მოცულობა
tr: kapasite

source: address
ka: მისამართი
tr: adres

source: range
ka: დიაპაზონი
tr: aralık

source: width
ka: სიგანე
tr: genişlik

source: clock
ka: საათი
tr: saat

source: capabilities
ka: შესაძლებლობები
tr: yetenekler

source: configuration:
ka: კონფიგურაცია:
tr: yapılandırma:

source: configuration of
ka: კონფიგურაცია ჩანაწერისთვის
tr: yapılandırması

source: resources:
ka: რესურსები:
tr: kaynaklar:

source: resources of
ka: რესურსი ჩანაწერისთვის
tr: kaynakları

source: H/W path
ka: აპარ. ბილიკი
tr: H/W yolu

source: Device
ka: მოწყობილობა
tr: Aygıt

source: Class
ka: კლასი
tr: Sınıf

source: Description
ka: აღწერა
tr: Açıklama

source: Bus info
ka: მატარებელის ინფორმაცია
tr: Veri yolu Bilgileri

source: Audio device
ka: აუდიო მოწყობილობა
tr: Ses aygıtı

source: Control device
ka: კონტროლის მოწყობილობა
tr: Kontrol cihazı

source: Audio streaming
ka: აუდიო სტრიმინგი
tr: Ses akışı

source: Communication device
ka: კომუნიკაციის მოწყობილობა
tr: İletişim cihazı

source: Modem
ka: მოდემი

source: AT (Hayes) compatible
ka: AT (Hayes) თავსებადი
tr: AT (Hayes) uyumlu

source: Ethernet networking
ka: Ethernet ქსელი
tr: Ethernet ağı

source: OBEX networking
ka: OBEX ქსელი
tr: OBEX ağ iletişimi

source: Human interface device
ka: ადამიანთან ურთიერთობის მოწყობილობა
tr: İnsan arabirim cihazı

source: Keyboard
ka: კლავიატურა
tr: Klavye

source: Mouse
ka: თაგუნა
tr: Fare

source: Printer
ka: პრინტერი
tr: Yazıcı

source: Unidirectional
ka: ცალმხრივი
tr: Tek yönlü

source: Bidirectional
ka: ორმხრივი
tr: Çift yönlü

source: IEEE 1284.4 compatible bidirectional
ka: IEEE 1284.4 თავსებადი ორმხრივი
tr: IEEE 1284.4 uyumlu çift yönlü

source: Mass storage device
ka: დიდი საცავის მოწყობილობა
tr: Yığın depolama aygıtı

source: RBC (typically Flash) mass storage
ka: RBC (როგორც წესი, Flash) დიდი საცავი
tr: RBC (tipik olarak Flash) yığın depolama

source: Floppy (UFI)
ka: დისკეტა (UFI)
tr: Disket (UFI)

source: USB hub
ka: USB კომუტატორი

source: Smart card reader
ka: ჭკვიანი ბარათის წამკითხველი
tr: Akıllı kart okuyucu

source: Video
ka: ვიდეო

source: Bluetooth wireless interface
ka: ბლუთუზის უსადენო ინტერფეისი
tr: Bluetooth kablosuz arayüz

source: Bluetooth wireless radio
ka: ბლუთუზის უსადენო რადიო
tr: Bluetooth kablosuz radyo

source: Generic USB device
ka: ზოგადი USB მოწყობილობა
tr: Genel USB aygıtı

source: Blank volume
ka: ცარიელი ტომი

source: Windows FAT volume
ka: Windows-ის FAT ტომი

source: Windows NTFS volume
ka: Windows-ის NTFS ტომი

source: OS/2 HPFS volume
ka: OS/2-ის HPFS ტომი

source: EXT2/EXT3 volume
ka: EXT2/EXT3 ტომი

source: Linux ReiserFS volume
ka: Linux ReiserFS ტომი

source: Linux ROMFS volume
ka: Linux ROMFS ტომი

source: Linux SquashFS volume
ka: Linux SquashFS ტომი

source: Linux CramFS volume
ka: Linux CramFS ტომი

source: MinixFS volume
ka: MinixFS ტომი

source: System V FS volume
ka: System V FS ტომი

source: Linux JFS volume
ka: Linux JFS ტომი

source: Linux XFS volume
ka: Linux XFS ტომი

source: ISO-9660 volume
ka: ISO-9660 ტომი

source: X-Box DVD volume
ka: X-Box DVD ტომი

source: UDF volume
ka: UDF ტომი

source: UFS volume
ka: UFS ტომი

source: HP-UX HFS volume
ka: HP-UX HFS ტომი

source: VxFS volume
ka: VxFS ტომი

source: FFS volume
ka: FFS ტომი

source: BeOS BFS volume
ka: BeOS BFS ტომი

source: QNX FS volume
ka: QNX FS ტომი

source: MacOS MFS volume
ka: MacOS MFS ტომი

source: MacOS HFS+ volume
ka: MacOS HFS+ ტომი

source: MacOS HFS volume
ka: MacOS HFS ტომი

source: MacOS APFS volume
ka: MacOS APFS ტომი

source: Linux Unified Key Setup volume
ka: Linux Unified Key Setup ტომი

source: Linux swap volume
ka: Linux swap ტომი

source: Extended Attributes
ka: გაფართოებული ატრიბუტები
tr: Genişletilmiş Özellikler

source: 4GB+ files
ka: 4GB+ ფაილები
tr: 4GB+ dosyalar

source: 16TB+ files
ka: 16TB+ ფაილები
tr: 16TB+ dosyalar

source: directories with 65000+ subdirs
ka: საქაღალდეები 65000+ ქვესაქაღალდით
tr: 65000+ alt dizine sahip dizinler

source: needs recovery
ka: სჭირდება აღდგენა
tr: kurtarma ihtiyacı

source: 64bit filesystem
ka: 64-ბიტიანი ფაილური სისტემა
tr: 64bit dosya Sistemi

source: EXT4 volume
ka: EXT4 ტომი
tr: EXT4 düzeyi

source: EXT3 volume
ka: EXT3 ტომი
tr: EXT3 düzeyi

source: Encrypted volume
ka: დაშიფრული ტომი
tr: Şifreleme düzeyi

source: Contains a bootable Mac OS installation
ka: შეიცავს ჩატვირთვად Mac OS-ს
tr: Önyüklenebilir bir Mac OS kurulumu içerir

source: Contains a bootable Mac OS X installation
ka: შეიცავს ჩატვირთვად Mac OS X-ს
tr: Önyüklenebilir bir Mac OS X yüklemesi içerir

source: initialized volume
ka: ინიციალიზებული ტომი
tr: başlatılmış düzey

source: configuration
ka: მორგება
tr: yapılandırma

source: resources
ka: რესურსები
tr: kaynaklar

source: this device hasn't been claimed
ka: ეს მოწყობილობა არ გამოთხოვილა
tr: bu cihaz için hak talebinde bulunulmadı

source: this device has been disabled
ka: ეს მოწყობილობა გათიშულია
tr: bu cihaz devre dışı bırakıldı

source: usage: %s [-format] [-options ...]
ka: გამოყენება: %s [-ფორმატი] [-პარამეტრები ...]
tr: kullanım: %s [-biçim] [-seçenekler ...]

source: -version print program version (%s)
ka: -version პროგრამის ვერსიის გამოტანა (%s)
tr: -sürüm yazdırma programı sürümü (%s)

source: format can be
ka: ფორმატი შეიძლება იყოს
tr: biçim olabilir

source: -html output hardware tree as HTML
ka: -html აპარატურის ხის HTML-ში გამოტანა
tr: -html çıktı donanım ağacını HTML olarak

source: -xml output hardware tree as XML
ka: -xml აპარატურის ხის XML-ში გამოტანა
tr: -xml çıktı donanım ağacı XML olarak

source: -json output hardware tree as a JSON object
ka: -json აპარაურის ხის JSON ობიექტად გატანა

source: -short output hardware paths
ka: -short აპარატურის ბილიკების გამოტანა
tr: -kısa çıkış donanım yolları

source: -businfo output bus information
ka: -businfo მატარებლის ინფორმაციის გამოტანა
tr: -veri yolu çıkış veri yolu bilgisi

source: -X use graphical interface
ka: -X გრაფიკული ინტერფეისის გამოყენება
tr: -X grafik arayüzü kullan

source: options can be
ka: პარამეტრები შეიძლება იყოს
tr: seçenekler olabilir

source: -dump filename display output and dump collected information into a file (SQLite database)
ka: -dump ფაილისსახელი გამოტანის ჩვენება და მოგროვებული ინფორმაციის ფაილში (SQLite ბაზაში) შენახვა

source: -class CLASS only show a certain class of hardware
ka: -class კლასი მხოლოდ მითითებული კლასის აპარატურის ჩვენება
tr: -sınıf SINIF yalnızca belirli bir donanım sınıfını gösterir

source: -C CLASS same as '-class CLASS'
ka: -C კლასი იგივე, რაც '-class კლასი'
tr: -C SINIF -sınıf SINIF ile aynı

source: -c CLASS same as '-class CLASS'
ka: -c კლასი იგივე, რაც '-class კლასი'
tr: -c SINIF -sınıf SINIF ile aynı

source: -disable TEST disable a test (like pci, isapnp, cpuid, etc.)
ka: -disable ტესტი მითითებული ტესტის (მაგ pci, isapnp, cpuid, ა.შ.) გამორთვა

source: -enable TEST enable a test (like pci, isapnp, cpuid, etc.)
ka: -enable ტესტი მითითებული ტესტის (მაგ pci, isapnp, cpuid, ა.შ.) ჩართვა

source: -quiet don't display status
ka: -quiet სტატუსი გამოტანილი არ იქნება
tr: -sessiz durumu gösterme

source: -sanitize sanitize output (remove sensitive information like serial numbers, etc.)
ka: -sanitize გამოტანის გასაგზავნად დამუშავება (წაიშლება ისეთი ინფორმაცია, როგორიცაა სერიული ნომრები და ა.შ.)
tr: -sterilize çıkışı sterilize edin (seri numaraları vb. gibi hassas bilgileri kaldırın)

source: -numeric output numeric IDs (for PCI, USB, etc.)
ka: -numeric რიცხვითი ID-ების გამოტანა (PCI, USB, და ა.შ. მატარებლებისთვის)
tr: -sayısal çıktı sayısal kimlikleri (PCI, USB vb. için)

source: -notime exclude volatile attributes (timestamps) from output
ka: -notime გამოტანიდან აქროლადი ატრიბუტების(დროის შტამპების) ამოღება

source: the latest version is %s
ka: უკანასკნელი ვერსიაა %s
tr: en son sürüm %s

source: WARNING: you should run this program as super-user.
ka: გაფრთხილება: ეს პროგრამა ზემომხმარებლით უნდა გაუშვათ.
tr: UYARI: Bu programı süper kullanıcı olarak çalıştırmalısınız.

source: WARNING: output may be incomplete or inaccurate, you should run this program as super-user.
ka: გაფრთხილება: გამოტანილი ინფორმაცია შეიძლება არასრული ან არასწორი იყოს. ეს პროგრამა ზემომხმარებლით უნდა გაუშვათ.
tr: UYARI: Çıktı eksik veya hatalı olabilir, bu programı süper kullanıcı olarak çalıştırmalısınız.

source: HyperThreading
tr: Hiper İş Parçacığı

source: Other
tr: Diğer

source: Unknown
tr: Bilinmiyor

source: Lead Acid
tr: Kurşun Asit

source: Nickel Cadmium
tr: Nikel Kadmiyum

source: Nickel Metal Hydride
tr: Nikel Metal Hidrit

source: Lithium Ion
tr: Lityum İyon

source: Zinc Air
tr: Çinko Hava

source: Lithium Polymer
tr: Lityum Polimer

source: Connectivitiy Switch
tr: Bağlantı Anahtarı

source: PCMCIA/PCCard
tr: PCMCIA/PC Kartı

source: Plug-and-Play
tr: Tak ve Oynat

source: Write-trough
tr: Baştan sona yazma

source: Write-back
tr: Geri-yazma

source: NuBus
tr: NuVeri yolu

source: RAMBUS
tr: RAMVERİ YOLU

source: CPU
tr: İŞLEMCİ

source: iomemory
tr: iohafıza

source: ioport
tr: iobağlantı noktası

source: loopback
tr: geri döngü

source: IPtunnel
tr: IPgeçidi

source: Framerelay.DLCI
tr: Çerçeve Aktarımı.DLCI

source: Framerelay.AD
tr: Çerçeve Rölesi.AD

source: IP6tunnel
tr: IP6geçidi

source: Wireless-LAN
tr: Kablosuz LAN

source: Media Independant Interface
tr: Medyadan Bağımsız Arayüz

source: UNCLAIMED
tr: SAHİPSİZ

source: extent-based allocation
tr: kapsam tabanlı tahsis

source: volume
tr: düzey

source: %s -version
tr: %s -sürüm

source: -disable TEST disable a test (like pci, isapnp, cpuid, etc. )
tr: -devre dışı TEST bir testi devre dışı bırakır (pci, isapnp, cpuid, vb. gibi)

source: -enable TEST enable a test (like pci, isapnp, cpuid, etc. )
tr: -TEST i Etkinleştir bir testi etkinleştirir (pci, isapnp, cpuid, vb. gibi)
