/*
 * partitions.cc
 *
 *
 */

#define _LARGEFILE_SOURCE
#define _FILE_OFFSET_BITS	64

#include "version.h"
#include "partitions.h"
#include "blockio.h"
#include "lvm.h"
#include "osutils.h"
#include <stdio.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <stdint.h>

__ID("@(#) $Id$");

#define LIFBLOCKSIZE 256

struct maptypes
{
	const char * id;
	const char * description;
	bool (*detect)(source & s, hwNode & n);
};

static bool detect_dosmap(source & s, hwNode & n);
static bool detect_macmap(source & s, hwNode & n);
static bool detect_lif(source & s, hwNode & n);
static bool detect_gpt(source & s, hwNode & n);

static struct maptypes map_types[] = {
	{"mac", "Apple Macintosh partition map", detect_macmap},
	{"bsd", "BSD disklabel", NULL},
	{"gpt", "GUID partition table", detect_gpt},
	{"dos", "MS-DOS partition table", detect_dosmap},
	{"lif", "HP-UX LIF", detect_lif},
	{"solaris-x86", "Solaris disklabel", NULL},
	{"solaris-sparc", "Solaris disklabel", NULL},
	{"raid", "Linux RAID", NULL},
	{"lvm", "Linux LVM", NULL},
	{"atari", "Atari ST", NULL},
	{"amiga", "Amiga", NULL},
	{ NULL, NULL, NULL }
};

struct fstypes
{
	const char * id;
	const char * description;
	const char * capabilities;
};

static struct fstypes fs_types[] = {
	{"blank", "Blank", ""},
	{"fat", "MS-DOS FAT derivatives (FAT12, FAT16, FAT32)", ""},
	{"ntfs", "Windows NTFS", "secure"},
	{"hpfs", "OS/2 HPFS", "secure"},
	{"ext2", "Linux EXT2", "secure"},
	{"ext3", "Linux EXT3", "secure,journaled"},
	{"reiserfs", "Linux ReiserFS", "secure,journaled"},
	{"romfs", "Linux ROMFS", "ro"},
	{"squashfs", "Linux SquashFS", "ro"},
	{"cramfs", "Linux CramFS", "ro"},
	{"minixfs", "MinixFS", "secure"},
	{"sysvfs", "System V FS", "secure"},
	{"jfs", "Linux JFS", "secure,journaled"},
	{"xfs", "Linux XFS", "secure,journaled"},
	{"iso9660", "ISO-9660", "secure,ro"},
	{"xboxdvd", "X-Box DVD", "ro"},
	{"udf", "UDF", "secure,ro"},
	{"ufs", "UFS", "secure"},
	{"hphfs", "HP-UX HFS", "secure"},
	{"vxfs", "VxFS", "secure,journaled"},
	{"ffs", "FFS", "secure"},
	{"befs", "BeOS BFS", "journaled"},
	{"qnxfs", "QNX FS", ""},
	{"mfs", "MacOS MFS", ""},
	{"hfs", "MacOS HFS", ""},
	{"hfsplus", "MacOS HFS+", "secure,journaled"},
	{ NULL, NULL, NULL }
};

struct efi_guid_t
{
        uint32_t time_low;
        uint16_t time_mid;
        uint16_t time_hi_and_version;
        uint8_t  clock_seq_hi_and_reserved;
        uint8_t  clock_seq_low;
        uint8_t  node[6];
};

struct gpth
{
        uint64_t Signature;			/* offset: 0 */
        uint32_t Revision;			/* 8 */
        uint32_t HeaderSize;			/* 12 */
        uint32_t HeaderCRC32;			/* 16 */
        uint32_t Reserved1;			/* 20 */
        uint64_t MyLBA;				/* 24 */
        uint64_t AlternateLBA;			/* 32 */
        uint64_t FirstUsableLBA;		/* 40 */
        uint64_t LastUsableLBA;			/* 48 */
        efi_guid_t DiskGUID;			/* 56 */
        uint64_t PartitionEntryLBA;		/* 72 */
        uint32_t NumberOfPartitionEntries;	/* 80 */
        uint32_t SizeOfPartitionEntry;		/* 84 */
        uint32_t PartitionEntryArrayCRC32;	/* 88 */
};

struct efipartition
{
	efi_guid_t PartitionTypeGUID;
	efi_guid_t PartitionGUID;
	uint64_t StartingLBA;
	uint64_t EndingLBA;
	uint64_t Attributes;
	string PartitionName;
};

#define GPT_PMBR_LBA 0
#define GPT_PMBR_SECTORS 1
#define GPT_PRIMARY_HEADER_LBA 1
#define GPT_HEADER_SECTORS 1
#define GPT_PRIMARY_PART_TABLE_LBA 2

#define EFI_PMBR_OSTYPE_EFI 0xee
#define GPT_HEADER_SIGNATURE 0x5452415020494645LL	/* "EFI PART" */

struct dospartition
{
	unsigned long long start;
	unsigned long long size;
	unsigned char type;
	unsigned char flags;
};

/* DOS partition types (from util-linux's fdisk)*/
struct systypes
{
	const unsigned char type;
	const char * description;
	const char * id;
	const char * capabilities;
	const char * icon;
};


static struct systypes dos_sys_types[] = {
	{0x00, "Empty", "empty", "nofs", ""},
	{0x01, "FAT12", "fat12", "", ""},
	{0x02, "XENIX root", "xenix", "", ""},
	{0x03, "XENIX usr", "xenix", "", ""},
